{"draft":false,"categories":["personal","thoughts"],"layout":"post","title":"Why not be special?","date":"2016-05-11 04:55:15 -0700","emoji":"⭐️️","show_author":true,"slug":"special-or-not","ext":".md","tags":[],"excerpt":"<p>That might seem like a presumptious title. But is it really? In my experience\nI’ve encountered two conflicting ideas around personal worth.</p>\n\n","content":"<p>That might seem like a presumptious title. But is it really? In my experience\nI’ve encountered two conflicting ideas around personal worth.</p>\n\n<p>There’s the idea that every person is special; that each individual has unique\nqualities which add something to the world. That’s what my parents told me,\nanyway.</p>\n\n<p>Then there’s the second idea, best delivered in Palahniuk’s <em>Fight Club</em>.</p>\n\n<blockquote>\n  <p>You are not special. You’re not a beautiful and unique snowflake. You’re the\nsame decaying organic matter as everything else. We’re all part of the same\ncompost heap. We’re all singing, all dancing crap of the world.</p>\n</blockquote>\n\n<p>And for the most part, I appreciate this sentiment. If you were to zoom way out\nand view humanity as it is – a massive swell of life on the surface of Earth’s\nland mass – no particular human stands out.</p>\n\n<p>But at the human scale, we tend to take notice of the special ones. The fact\nthat I’d rather use Chuck Palahniuk’s quote than write an idea out myself is\nme acknowledging his literary accomplishment; his unique qualities that made his\nwritten works a possibility.</p>\n\n<p>On most days, I like to think cynically to myself about the statistical anomaly\nI would have to be in order to achieve anything note-worthy at a larger scale.\nI’m not like the most successful people. I’m just not one of those\nwake-up-super-early-and-carpe-the-fucking-diem type people.</p>\n\n<p>But logically that kind of thinking is a terribly self degrading choice. I may\nnot carpe all my diems but there are moments I <em>do</em> choose to seize. Moments\nwhere I think to myself: “If somebody’s gonna say something, might as well be me.”</p>\n\n<p>Lately I’ve been trying to find a full-time role with a company I like, and I’ve\nbeen a bit precious about it because I want to find a good fit. For me, this is\nwhere the internal struggle about whether or not I’m special occurs most often.</p>\n\n<p>Businesses aren’t usually all that precious about their candidates.</p>\n\n<p>But I’ve come away from this experience a bit more decided. This may not surprise\nyou, but I think I’m special. Sometimes, anyway. For some things. And for the\nrecord: I think you’re special too. Sometimes, probably. For some things.</p>\n\n<p>Whether or not you or I live on in humanity’s history books is irrelevant.\nIt’s up to humanity to judge that after we’re dead, so maybe it’s just not worth\nstressing over until then.</p>\n\n<p>Might as well believe you’re special.</p>\n","url":"/blog/special-or-not/"}
